'''
Формат входных данных
На вход программе подаётся строка-разделитель и три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введённые три строки через разделитель.
'''
separator = input()
a = input()
b = input()
c = input()
print(a, b, c, sep = separator)